# Database Management System

Object Serialization and De-Serialization method in Pythod

# Pickle Method in Pythod

Serialization Method - Dump method in pickle

In [1]:
import pickle

sending file out for other use pupose/for reuse at other location in binary mode with object file extension

In [2]:
flower_dict={1:"Rose",2:"Tulip",3:"Lily",4:"Lotus"}  #dictonary creation

In [4]:
filename = "flower" # creating object with file name for dictonary so we can outfile

In [5]:
outfile=open("flower.obj","wb")  # opening dictionary in object file with write mode

In [6]:
pickle.dump(flower_dict,outfile)   # sending file out

In [7]:
outfile.close() # close the file

In [8]:
infile=open("flower.obj","rb")  # open object file in read mode

In [9]:
flow1_dict=pickle.load(infile)  # create dictionary to load the file in from outside with load keyword

In [10]:
infile.close() #close file

In [11]:
print(flow1_dict) # print data from loaded dictinary which is converted from object file

{1: 'Rose', 2: 'Tulip', 3: 'Lily', 4: 'Lotus'}

In [12]:
print(flow1_dict==flower_dict)  # checking new dict and old dict have same with zero mismatch in content

True

In [13]:
print(type(flow1_dict)) # to check the type of new brought file

<class 'dict'>

# Import SQLite in python to work with Database

In [14]:
import sqlite3  # import sqlite software

Working with the database using SQL (Structured Query Language)

1. Create a connection object.          dbcon
2. From the connection object, create a curson object.    cur = dbcon.curso()
3. Using the cursor object, call the execute method with create table query as the parameter. cur.execute

# Create Database  and Table

dbcon=sqlite3.connect("student_database.db")  # creating a database

In [18]:
cur=dbcon.cursor() # creating cursor (creating temporary work area for database)

In [19]:
# creating table with primary key using cursor because sql in working through interaction of python

cur.execute("create table student(stud_id int primary key,stud_name text,stud_marks int)")

In [20]:
cur.execute("insert into student(stud_id,stud_name,stud_marks) values (1,'Bhumika',60)")  #insert the value into the table
dbcon.commit()

In [21]:
 #using for loop because we are using sql with help of python so multiple record wont be able to show without help of for loop
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika', 60)

In [22]:
cur.execute("insert into student(stud_id,stud_name,stud_marks) values (2,'Vivek',80)")
dbcon.commit()

In [26]:
result=cur.execute("select * from student")  # cursor can show you data only one row data at a time
for i in result:
    print(i)

(1, 'Bhumika', 60)
(2, 'Vivek', 80)
(3, 'Keyur', 90)

In [25]:
cur.execute("insert into student(stud_id,stud_name,stud_marks) values (3,'Keyur',90)")
dbcon.commit()

In [31]:
result=cur.execute("select * from student")  
for i in result:
    print(i)

(1, 'Bhumika', 60)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)

In [28]:
cur.execute("insert into student(stud_id,stud_name,stud_marks) values (4,'Bhavna',100)")
dbcon.commit()

In [30]:
cur.execute("insert into student(stud_id,stud_name,stud_marks) values (5,'Atul'100)")
dbcon.commit()

In [32]:
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika', 60)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)

In [34]:
result=cur.execute("select stud_name from student")
for i in result:
    print(i)

('Bhumika',)
('Vivek',)
('Keyur',)
('Bhavna',)
('Atul',)

In [36]:
result=cur.execute("select stud_name,stud_marks from student")
for i in result:
    print(i)

('Bhumika', 60)
('Vivek', 80)
('Keyur', 90)
('Bhavna', 100)
('Atul', 100)

In [37]:
result=cur.execute("select * from student where stud_name='Vivek'")
for i in result:
    print(i)

(2, 'Vivek', 80)

In [41]:
cur.execute("insert into student values (7,'Hansa',100)")
dbcon.commit()

In [44]:
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika', 60)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)
(6, 'Kailash', 70)
(7, 'Hansa', 100)

In [45]:
# insert multiple records with one line command
cur.execute("insert into student values (8,'Anu',99),(9,'Hardi',33),(10,'Ankit',45)")
dbcon.commit()

In [46]:
# count of rows inserted just now

print(cur.rowcount,"Record(s) Interted")

3 Record(s) Interted

And and Or operator  with where

In [48]:
result=cur.execute("select * from student where stud_name='Bhumika'")
for i in result:
    print(i)

(1, 'Bhumika', 60)

In [49]:
result=cur.execute("select * from student where stud_name='Bhumika' or stud_id=10")
for i in result:
    print(i)

(1, 'Bhumika', 60)
(10, 'Ankit', 45)

In [56]:
result=cur.execute("select * from student where stud_marks >= 50 and stud_marks<=105")
for i in result:
    print(i)

(1, 'Bhumika', 60)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)
(6, 'Kailash', 70)
(7, 'Hansa', 100)
(8, 'Anu', 99)

In [57]:
print(cur.rowcount)

-1

In [52]:
# when we want to fetch one and only one specified record then we use fetchone

result=cur.execute("select * from student where stud_name='Bhumika'")
result.fetchone()

(1, 'Bhumika', 60)

In [54]:
# when we want to fetch all the records then fetchall from given condition

result=cur.execute("select * from student where stud_id in (1,4,6,9)")
result.fetchall()

[(1, 'Bhumika', 60), (4, 'Bhavna', 100), (6, 'Kailash', 70), (9, 'Hardi', 33)]

In [55]:
# when we want to fetch all the records without any condition

result=cur.execute("select * from student")
result.fetchall()

[(1, 'Bhumika', 60),
 (2, 'Vivek', 80),
 (3, 'Keyur', 90),
 (4, 'Bhavna', 100),
 (5, 'Atul', 100),
 (6, 'Kailash', 70),
 (7, 'Hansa', 100),
 (8, 'Anu', 99),
 (9, 'Hardi', 33),
 (10, 'Ankit', 45)]

In [60]:
result=cur.execute("select * from student where stud_id between 2 and 10")
result.fetchall()

[(2, 'Vivek', 80),
 (3, 'Keyur', 90),
 (4, 'Bhavna', 100),
 (5, 'Atul', 100),
 (6, 'Kailash', 70),
 (7, 'Hansa', 100),
 (8, 'Anu', 99),
 (9, 'Hardi', 33),
 (10, 'Ankit', 45)]

In [61]:
result=cur.execute("select * from student limit 5")
for i in result:
    print(i)

(1, 'Bhumika', 60)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)

In [62]:
result=cur.execute("select * from student order by stud_name asc")
for i in result:
    print(i)

(10, 'Ankit', 45)
(8, 'Anu', 99)
(5, 'Atul', 100)
(4, 'Bhavna', 100)
(1, 'Bhumika', 60)
(7, 'Hansa', 100)
(9, 'Hardi', 33)
(6, 'Kailash', 70)
(3, 'Keyur', 90)
(2, 'Vivek', 80)

In [64]:
result=cur.execute("select * from student order by stud_name desc")
for i in result:
    print(i)

(2, 'Vivek', 80)
(3, 'Keyur', 90)
(6, 'Kailash', 70)
(9, 'Hardi', 33)
(7, 'Hansa', 100)
(1, 'Bhumika', 60)
(4, 'Bhavna', 100)
(5, 'Atul', 100)
(8, 'Anu', 99)
(10, 'Ankit', 45)

In [65]:
result=cur.execute("select min(stud_marks) from student")
for i in result:
    print(i)

(33,)

In [74]:
result=cur.execute("select max(stud_marks) from student")
result.fetchone()

(100,)

In [75]:
result=cur.execute("select max(stud_marks) from student")
for i in result:
    print(i)

(100,)

In [70]:
result=cur.execute("select avg(stud_marks) from student")
result.fetchall()

[(77.7,)]

In [71]:
result=cur.execute("select sum(stud_marks) from student")
result.fetchall()

[(777,)]

In [77]:
result=cur.execute("select count(stud_id) from student")
for i in result:
    print(i)

(10,)

In [82]:
result=cur.execute("select * from student where stud_marks is not null")
for i in result:
    print(i)

(1, 'Bhumika', 60)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)
(6, 'Kailash', 70)
(7, 'Hansa', 100)
(8, 'Anu', 99)
(9, 'Hardi', 33)
(10, 'Ankit', 45)

In [83]:
result=cur.execute("select * from student where stud_marks is null")
for i in result:
    print(i)

In [90]:
result=cur.execute("select * from student where stud_name like 'v%'")
for i in result:
    print(i)

(2, 'Vivek', 80)

In [96]:
# ___ number of underscscore means number of character for name 
result=cur.execute("select * from student where stud_name like '_____'")
for i in result:
    print(i)

(2, 'Vivek', 80)
(3, 'Keyur', 90)
(7, 'Hansa', 100)
(9, 'Hardi', 33)
(10, 'Ankit', 45)

# Update the record in database with python

In [102]:
# update record in existing table by assigning variable sql or any other name of variable
 
sql="update student set stud_name='Bhumika Vivek Agarwal' where stud_name='Bhumika'"
cur.execute(sql)
dbcon.commit()

In [103]:
# updated record 
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika Vivek Agarwal', 60)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)
(6, 'Kailash', 70)
(7, 'Hansa', 100)
(8, 'Anu', 99)
(9, 'Hardi', 33)
(10, 'Ankit', 45)

In [104]:
# another way to update query without assigning variable

cur.execute("update student set stud_marks=95 where stud_id=1")
dbcon.commit()

In [107]:
cur.execute("delete from student where stud_id=10")
dbcon.commit()

# Delete any unwanted record from Database

In [105]:
# delete any record from database

result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika Vivek Agarwal', 95)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)
(6, 'Kailash', 70)
(7, 'Hansa', 100)
(8, 'Anu', 99)
(9, 'Hardi', 33)
(10, 'Ankit', 45)

In [108]:
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika Vivek Agarwal', 95)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)
(6, 'Kailash', 70)
(7, 'Hansa', 100)
(8, 'Anu', 99)
(9, 'Hardi', 33)

In [117]:
# delete record by assingning variable 

sql="delete from student where stud_name='Hardi'"
cur.execute(sql)
dbcon.commit()

In [118]:
result=cur.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika Vivek Agarwal', 95)
(2, 'Vivek', 80)
(3, 'Keyur', 90)
(4, 'Bhavna', 100)
(5, 'Atul', 100)
(6, 'Kailash', 70)
(7, 'Hansa', 100)
(8, 'Anu', 99)

In [119]:
cur.execute("drop table student")   # or we can write         sql="delete table student"    cur.execute(sql)

In [120]:
result=cur.execute("select * from student")
for i in result:
    print(i)

OperationalError: no such table: student

In [122]:
dbcon.close()

# CSV File - comma sepreated file  

Whatever records are available in Table formate that will convert into comm sepreated file with comma

In [140]:
import sqlite3    #install sqlite

In [9]:
dbcon=sqlite3.connect("student_database.db") # create database

In [10]:
cursor=dbcon.cursor()   # create curson variable to connect with sql through python

In [11]:
result=cursor.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika', 56, 'A\n')
(2, 'Keyur', 89, 'A\n')
(3, 'Vivek', 90, 'A\n')
(4, 'Bhavna', 89, 'A\n')
(5, 'Hansa', 33, 'B\n')
(6, 'Kailash', 56, 'B\n')
(7, 'Hardi', 23, 'C')

In [163]:
with open('s1','r',) as file:
    total_records=0
    for row in file:
        cursor.execute("Insert into student values (?,?,?,?)",row.split(",")) 
        dbcon.commit()
        total_records+=1
    print(total_records,"Records inserted")

IntegrityError: UNIQUE constraint failed: student.no

In [164]:
result=cursor.execute("select * from student")
for i in result:
    print(i)

(1, 'Bhumika', 56, 'A\n')
(2, 'Keyur', 89, 'A\n')
(3, 'Vivek', 90, 'A\n')
(4, 'Bhavna', 89, 'A\n')
(5, 'Hansa', 33, 'B\n')
(6, 'Kailash', 56, 'B\n')
(7, 'Hardi', 23, 'C')

# Creating new Database and table

In [3]:
import sqlite3

In [4]:
dbcon=sqlite3.connect("Employee_databas.db")

In [5]:
cur=dbcon.cursor()

In [6]:
cur.execute("create table emp_info(emp_no int primarykey,emp_name txt,emp_phone int,emp_address txt)")

OperationalError: table emp_info already exists

In [8]:
with open('emp_info.txt','r',) as file:
    total_records=0
    for row in file:
        cur.execute("Insert into emp_info values (?,?,?,?)",row.split(",")) 
        dbcon.commit()
        total_records+=1
    print(total_records,"Records inserted")

ProgrammingError: Incorrect number of bindings supplied. The current statement uses 4, and there are 3 supplied.

In [9]:
cur.execute("drop table emp_info")

In [10]:
cur.execute("create table emp_info(emp_no int primary key,emp_name txt,emp_phone int,emp_address txt)")

In [13]:
with open('emp_info.txt','r') as file:
    total_records=0
    for row in file:
        cur.execute("Insert into emp_info values(?,?,?,?)",row.split(","))
        dbcon.commit()
        total_records+=1
    print(total_records,"Records inserted")

7 Records inserted

In [14]:
cur.execute("select * from emp_info")

In [15]:
result=cur.execute("select * from emp_info")
for i in result:
    print(i)

(1, 'BhumikaShah', 678909887, 'dfdfdsfadfadsf\n')
(2, 'HardiPatel', 623430224, 'fioweoradfkapoi\n')
(3, 'TejSingh', 1093802394, 'dsgergaerrtwr\n')
(4, 'TarunSingh', 409834093, 'dweporuwpeoifu\n')
(5, 'Sumedh Ramtek', 2039483209, 'cknvkljshf\n')
(6, 'Mayur Gor', 9238409328, 'thepwouirw\n')
(7, 'Madhurima T', 293840433, 'weoirewop')

In [8]:
import sqlite3

In [9]:
dbcon=sqlite3.connect("normal_database.db")

In [12]:
cur=dbcon.cursor()

In [20]:
cur.execute("create table nordb(no int primary key,name txt,age int)")

In [21]:
with open('myfile.csv','r') as file:
    total_records=0
    for row in file:
        cur.execute("insert into nordb values(?,?,?)",row.split(","))
        dbcon.commit()
        total_records+=1
    print(total_records,"Inserted Records")

5 Inserted Records

In [19]:
cur.execute('drop table nordb')

In [22]:
result=cur.execute('select * from nordb')
for i in result:
    print(i)

(1, 'bhumika', 43)
(2, 'vivek', 45)
(3, 'bhavna', 63)
(4, 'keyur', 40)
(5, 'ankita', 42)

Data constraints

In [24]:
cur.execute("create table sport(id int primary key,sportname text unique,dateofevent date not null, country text not null )")

In [29]:
cur.execute("insert into sport values(1,'football','2008-01-02','Canada')")

IntegrityError: UNIQUE constraint failed: sport.sportname

In [28]:
cur.execute("insert into sport values(2,'cricket','1999-05-12','India')")

In [30]:
result=cur.execute("Select * from sport")
for i in result:
    print(i)

(1, 'football', '2008-01-02', 'Canada')
(2, 'cricket', '1999-05-12', 'India')

In [31]:
result=cur.execute('select * from sport')
result.fetchall()

[(1, 'football', '2008-01-02', 'Canada'),
 (2, 'cricket', '1999-05-12', 'India')]

# Employee Datatbase with Database and Python Programming :

In [68]:
import sqlite3

In [69]:
con=sqlite3.connect("C:/Users/vibhu/Employee_databas.db")

In [70]:
def use_table(con):
    cur=con.cursor()
    cur.execute("drop table employee")
    con.comitt()

In [71]:
use_table(con)
con.comitt()

OperationalError: no such table: employee

In [114]:
import sqlite3

In [115]:
con=sqlite3.connect("c:/Users/Vibhu/Employee_database.db")

In [77]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id int primary key, name txt,salary real,department txt,position txt,hiredate date)")
    con.commit()

In [78]:
sql_table(con)

OperationalError: table employee already exists

In [80]:
cur=con.cursor()
cur.execute("insert into employee values(1,'Bhumika',6000,'IT','Data Analyst','1999-07-19')")

In [81]:
con.commit()

In [83]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Bhumika', 6000.0, 'IT', 'Data Analyst', '1999-07-19')]

In [84]:
def sql_insert(con,enitities):
    cur=con.cursor()
    cur.execute("insert into employee(id,name,salary,department,position,hiredate) values (?,?,?,?,?,?)",enitites)

In [85]:
enitites=(2,'Vivek',8000,'IT','Sr.Developer','1998-11-03')

In [88]:
sql_insert(con,enitites)

IntegrityError: UNIQUE constraint failed: employee.id

In [93]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Bhumika', 6000.0, 'IT', 'Data Analyst', '1999-07-19'),
 (2, 'Vivek', 8000.0, 'IT', 'Sr.Developer', '1998-11-03'),
 (3, 'Hardi', 4000.0, 'IT', 'Operation', '2008-08-11')]

In [89]:
enitites=(3,'Hardi',4000,'IT','Operation','2008-08-11')

In [92]:
sql_insert(con,enitites)

IntegrityError: UNIQUE constraint failed: employee.id

In [94]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Bhumika', 6000.0, 'IT', 'Data Analyst', '1999-07-19'),
 (2, 'Vivek', 8000.0, 'IT', 'Sr.Developer', '1998-11-03'),
 (3, 'Hardi', 4000.0, 'IT', 'Operation', '2008-08-11')]

In [95]:
enitites=(4,'Keyru',9000,'Maintainance','Project Engineer','2015-08-19')

In [98]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Bhumika', 6000.0, 'IT', 'Data Analyst', '1999-07-19'),
 (2, 'Vivek', 8000.0, 'IT', 'Sr.Developer', '1998-11-03'),
 (3, 'Hardi', 4000.0, 'IT', 'Operation', '2008-08-11'),
 (4, 'Keyru', 9000.0, 'Maintainance', 'Project Engineer', '2015-08-19')]

In [97]:
sql_insert(con,enitites)

In [102]:
results=cur.execute("select * from employee where salary >1000")
results.fetchall()

[(1, 'Bhumika', 6000.0, 'IT', 'Data Analyst', '1999-07-19'),
 (2, 'Vivek', 8000.0, 'IT', 'Sr.Developer', '1998-11-03'),
 (3, 'Hardi', 4000.0, 'IT', 'Operation', '2008-08-11'),
 (4, 'Keyru', 9000.0, 'Maintainance', 'Project Engineer', '2015-08-19')]

In [107]:
results=cur.execute("select id,name from employee where department='IT'")
results.fetchall()

[(1, 'Bhumika'), (2, 'Vivek'), (3, 'Hardi')]

In [3]:
def sql_upadet(con):
    cur=con.cursor()
    cur.execute("update employee set department='HR' where id=3")
    con.commit()

In [4]:
sql_upadet(con)

NameError: name 'con' is not defined

In [5]:
import sqlite3

In [6]:
con=sqlite3.connect("c:/Users/Vibhu/Employee_database.db")

In [7]:
def sql_upadet(con):
    cur=con.cursor()
    cur.execute("update employee set department='HR' where id=3")
    con.commit()

In [8]:
sql_upadet(con)

In [10]:
cur=con.cursor()
results=cur.execute("select * from employee where salary >1000")
results.fetchall()

[(1, 'Bhumika', 6000.0, 'IT', 'Data Analyst', '1999-07-19')]

# Referential Integrity

Referential Integrity is used to maintain the data consistency between two tables. Rules are made in the database structure about how foreing key should be used to ensure that changes;
addition and deltetion in the database maintian the data integrity. The referential integrity constraints state that if a foreign key in the first table referes to the primary key of 
the second table then every value of foreign key in the first table should either be null or present in the second table

con.execute("PRAGMA foreign_keys = 1")

In [4]:
import sqlite3

In [5]:
con=sqlite3.connect("C:/Users/vibhu/student_database.db")
con.execute("PRAGMA foreign_keys = 1")

In [6]:
cur=con.cursor()

In [15]:
cur.execute("create table course(courseid int primary key,coursename txt,duration int)")

In [40]:
cur.execute("Create table stud(roll_no int primary key,studname txt,age int,courseid int,foreign key(courseid) references course)")

OperationalError: table stud already exists

In [43]:
cur.execute("insert into course values(105,'Python',12),(106,'SQL',6),(107,'Data Analyst',6)")
print(cur.rowcount,"record(s) inserted")
con.commit()

IntegrityError: UNIQUE constraint failed: course.courseid

In [26]:
print(cur.rowcount,"record(s) inserted")
con.commit()

3 record(s) inserted

In [27]:
cur.execute("insert into stud values(1,'Bhumika',42,105),(2,'Vivek',44,107)")
print(cur.rowcount,"record(s) inserted")
con.commit()

2 record(s) inserted

In [28]:
results=cur.execute("select * from course")
results.fetchall()

[(101, 'Python', 12),
 (102, 'SQL', 6),
 (103, 'Data Analyst', 6),
 (105, 'Python', 12),
 (106, 'SQL', 6),
 (107, 'Data Analyst', 6)]

In [9]:
results=cur.execute("select * from stud")
results.fetchall()

[(1, 'Bhumika', 42, 105),
 (2, 'Vivek', 44, 107),
 (5, 'abc', 42, 109),
 (6, 'abc', 42, 109),
 (7, 'abc', 42, 109),
 (8, 'abc', 42, 109),
 (9, 'abc', 42, 109),
 (11, 'abc', 42, 103)]

In [8]:
cur.execute("insert into stud values(11,'abc',42,103)")
print(cur.rowcount,"record(s) inserted")
con.commit()

1 record(s) inserted

Sub Queries == Queries into the Query

In [10]:
cur=con.cursor()
results=cur.execute("Select * from stud where courseid=(select courseid from course where coursename='Python')")
results.fetchall()

[]

In [11]:
cur.execute("insert into course values(111,'Pn',12)")
print(cur.rowcount,"record(s) inserted")
con.commit()

1 record(s) inserted

In [12]:
cur.execute("insert into stud values(12,'abc',42,111)")
print(cur.rowcount,"record(s) inserted")
con.commit()

1 record(s) inserted

In [13]:
cur=con.cursor()
results=cur.execute("Select * from stud where courseid=(select courseid from course where coursename='Pn')")
results.fetchall()

[(12, 'abc', 42, 111)]

In [17]:
results=cur.execute("select * from course where coursename=(select studname from stud where courseid=105)")
results.fetchall()

[]

# Joints

Inner Joint - Data available in both table will displayed

In [18]:
join1="Select stud.roll_no,stud.studname,course.coursename,course.duration from stud INNER JOIN course ON stud.courseid=course.courseid"
results=cur.execute(join1)
for row in results:
    print(row)

(1, 'Bhumika', 'Python', 12)
(2, 'Vivek', 'Data Analyst', 6)
(11, 'abc', 'Data Analyst', 6)
(12, 'abc', 'Pn', 12)

In [19]:
results=cur.execute("select * from stud")
results.fetchall()

[(1, 'Bhumika', 42, 105),
 (2, 'Vivek', 44, 107),
 (5, 'abc', 42, 109),
 (6, 'abc', 42, 109),
 (7, 'abc', 42, 109),
 (8, 'abc', 42, 109),
 (9, 'abc', 42, 109),
 (11, 'abc', 42, 103),
 (12, 'abc', 42, 111)]

In [20]:
results=cur.execute("select * from course")
results.fetchall()

[(101, 'Python', 12),
 (102, 'SQL', 6),
 (103, 'Data Analyst', 6),
 (105, 'Python', 12),
 (106, 'SQL', 6),
 (107, 'Data Analyst', 6),
 (111, 'Pn', 12)]

Left Join - Data available in Left side table will displayed

In [21]:
join2="Select stud.roll_no,stud.studname,course.coursename,course.duration from stud left JOIN course ON stud.courseid=course.courseid"
results=cur.execute(join2)
for row in results:
    print(row)

(1, 'Bhumika', 'Python', 12)
(2, 'Vivek', 'Data Analyst', 6)
(5, 'abc', None, None)
(6, 'abc', None, None)
(7, 'abc', None, None)
(8, 'abc', None, None)
(9, 'abc', None, None)
(11, 'abc', 'Data Analyst', 6)
(12, 'abc', 'Pn', 12)

Right Join - Data available in Right side table will displayed

In [22]:
join3="Select stud.roll_no,stud.studname,course.coursename,course.duration from stud right JOIN course ON stud.courseid=course.courseid"
results=cur.execute(join3)
for row in results:
    print(row)

(1, 'Bhumika', 'Python', 12)
(2, 'Vivek', 'Data Analyst', 6)
(11, 'abc', 'Data Analyst', 6)
(12, 'abc', 'Pn', 12)
(None, None, 'Python', 12)
(None, None, 'SQL', 6)
(None, None, 'SQL', 6)

Full Join - Both tables data will be displayed

In [25]:
join4="Select stud.roll_no,stud.studname,course.coursename,course.duration from stud full JOIN course ON stud.courseid=course.courseid"
results=cur.execute(join4)
for row in results:
    print(row)

(1, 'Bhumika', 'Python', 12)
(2, 'Vivek', 'Data Analyst', 6)
(5, 'abc', None, None)
(6, 'abc', None, None)
(7, 'abc', None, None)
(8, 'abc', None, None)
(9, 'abc', None, None)
(11, 'abc', 'Data Analyst', 6)
(12, 'abc', 'Pn', 12)
(None, None, 'Python', 12)
(None, None, 'SQL', 6)
(None, None, 'SQL', 6)